# parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

l1: 4
l2: 8
c1: 128
c2: 512

backbone:
  # [from, number, module, args]
  [[-1, 1, BFM, [3]],
  #  [-1, 1, Conv, [64, 3, 1]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

head:
  [[-1, 1, CARAFE, [512, 2, 2, 0, 0, 1, True]],
   [4, 1, Conv, [256, 3, 2]],
   [[-1, 6, -2], 1, AA, [640, 256]],
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, CARAFE, [256, 2, 2, 0, 0, 1, True]],
   [2, 1, Conv, [128, 3, 2]],

   [[-1, 4, -2], 1, AA, [320, 128]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

  [[13,17], 1, IDHead_Detect, [nc, anchors]],  # Detect(P3, P4, P5)

  ]
